//
//  Error.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "錯的使用者名稱或是密碼";
"_cancelled_by_user"                    = "取消傳送";
"_error_folder_destiny_is_the_same_"    = "沒辦法移動資料夾到自己。";
"_error_not_permission_"                = "您沒有權限完成此項操作。";
"_error_path_"                          = "沒辦法開啟這個檔案或是資料夾。請確認它是存在的。";
"_file_upload_not_exitst_"              = "我們想要上傳的檔案不存在。";
"_forbidden_characters_from_server_"    = "名字包含至少一個不合法的字元。";
"_not_connected_internet_"              = "伺服器連線錯誤";
"_not_possible_connect_to_server_"      = "現在無法連線到伺服器";
"_not_possible_create_folder_"          = "資料夾無法被建立";
"_server_down_"                         = "伺服器無法連線";
"_time_out_"                            = "逾時，請再試一次。";
"_unknow_response_server_"              = "伺服器的無預期回應";
"_user_autentication_required_"         = "需要使用者驗證";
"_file_directory_locked_"               = "檔案或目錄已鎖定";
"_ssl_certificate_untrusted_"           = "此伺服器憑證無效";
"_internal_server_"                     = "內部伺服器錯誤";

"_file_already_exists_"                 = "無法完成此項操作，因為有相同名字的檔案。";
"_file_folder_not_exists_"              = "來源檔在指定的路徑沒被找到。";
"_folder_contents_nochanged_"           = "此資料夾的內容還未被更動。";
"_images_invalid_converted_"            = "圖片是不合規範的而且不能被轉成縮圖。";
"_method_not_expected_"                 = "需求的方法不是預期的。";
"_reauthenticate_user_"                 = "連線憑證過期，請重新驗證";
"_server_error_retry_"                  = "伺服器現在暫時不可使用";
"_too_many_files_"                      = "太多檔案被包含在這項操作要成功地完成。";
"_too_many_request_"                    = "達到速率限制，傳送太多需求。";
"_user_over_quota_"                     = "達到儲存空間限制";

"_ssl_connection_error_"                = "SSL連線錯誤，請再試一次。";
